app/controllers/api/projects_controller.rb

    def show
        @project = Project.find_by(id: params[:id])
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]

    def update
        @project = Project.find_by(id: params[:id])
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]

    def destroy
        @project = Project.find_by(id: params[:id])

        if @project.destroy
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
DELETE FROM "projects" WHERE "projects"."id" = $1  [["id", 14]]